# 파일 불러오기

In [18]:
import pandas as pd

## csv 파일 불러오기

In [2]:
data_frame = pd.read_csv('data/friend_list.csv')

In [3]:
data_frame

  ﻿name   age        job
0   john   20    student
1  jenny   30  developer
2   nate   30    teacher
3  julia   40    dentist
4  Brian   45    manager
5  Chris   25     intern

In [4]:
data_frame.head(2)

  ﻿name   age        job
0   john   20    student
1  jenny   30  developer

In [5]:
data_frame.tail(2)

  ﻿name   age      job
4  Brian   45  manager
5  Chris   25   intern

In [6]:
type(data_frame.job)

pandas.core.series.Series

## 텍스트 파일 불러오기

In [2]:
fl = pd.read_csv('data/friend_list.txt')

In [3]:
fl

   name   age        job
0   john   20    student
1  jenny   30  developer
2   nate   30    teacher
3  julia   40    dentist
4  Brian   45    manager
5  Chris   25     intern

csv 파일은 ','를 이용해 데이터들을 하나의 셀로 구분한다

그래서 텍스트 파일의 데이터가 ','로 구분 되어 있으면 동일하게 읽어 올 수 있다

### tab으로 구분된 txt 피일 불러오기

In [4]:
df = pd.read_csv('data/friend_list_tab.txt')

In [8]:
df

    name   age        job
0   john    20    student
1  jenny    30  developer
2   nate    30    teacher
3  julia    40    dentist
4  Brian    45    manager
5  Chris    25     intern

구별된 문자를 delimiter에 지정해 주면 정상적으로 읽어 올 수 있다

In [6]:
df = pd.read_csv('data/friend_list_tab.txt',delimiter='\t')

In [7]:
df

    name   age        job
0   john    20    student
1  jenny    30  developer
2   nate    30    teacher
3  julia    40    dentist
4  Brian    45    manager
5  Chris    25     intern

## 헤더 없는 파일 불러오기

In [9]:
df = pd.read_csv('data/friend_list_no_head.csv')

In [10]:
df

   ﻿john  20    student
0  jenny  30  developer
1   nate  30    teacher
2  julia  40    dentist
3  Brian  45    manager
4  Chris  25     intern

처음 줄의 값을 헤더로 인지하기 때문에 헤더가 없는 파일은 헤더가 없음을 명시 해야한다

In [11]:
df = pd.read_csv('data/friend_list_no_head.csv',header=None)

In [12]:
df

       0   1          2
0  ﻿john  20    student
1  jenny  30  developer
2   nate  30    teacher
3  julia  40    dentist
4  Brian  45    manager
5  Chris  25     intern

헤더를 명시적으로 지정하여 추가 할 수 있다

In [13]:
df.columns=['name','age','job']

In [14]:
df

    name  age        job
0  ﻿john   20    student
1  jenny   30  developer
2   nate   30    teacher
3  julia   40    dentist
4  Brian   45    manager
5  Chris   25     intern

헤더가 없는 데이터 파일을 읽어오면서 헤더를 동시에 지정도 가능하다

In [16]:
df = pd.read_csv('data/friend_list_no_head.csv',header=None, names = ['name','age','job'])

In [17]:
df

    name  age        job
0  ﻿john   20    student
1  jenny   30  developer
2   nate   30    teacher
3  julia   40    dentist
4  Brian   45    manager
5  Chris   25     intern